-- 셀프체크
-- 다음은 SNS 앱 개발을 하기 위한 요구사항의 일부입니다.
-- 이를 바탕으로 다음 1~5의 설명을 참고해 ER 다이어그램을 그리세요.

-- 요구사항
-- 사용자는 하나의 프로필을 가질 수 있고 이를 통해 개인 정보를 관리합니다. 
-- 사용자는 여러 사진을 게시할 수 있고, 각 사진은 여러 사용자로부터 좋아요와 댓글을 받을 수 있습니다.
-- 사용자는 다른 사용자의 사진에 좋아요를 누르거나 댓글을 남길 수 있습니다.


-- 1 사용자는 프로필을 등록하지 않을 수 있습니다. 그러나 프로필은 반드시 이를 작성한 사용자를 참조해야 합니다.
-- 사용자와 프로필의 관계를 ER 다이어그램으로 그리세요. 단, 속성은 생략합니다.


-- 2 사용자는 사진을 게시하지 않을 수 있습니다. 그러나 사진은 반드시 이를 게시한 사용자를 참조해야 합니다.
-- 사용자와 사진의 관계를 ER 다이어그램으로 그리세요. 단, 속성은 생략합니다.


-- 3 사용자는 사진에 대해 좋아요를 누르지 않을 수 있고, 사진도 사용자로부터 좋아요를 받지 못할 수 있습니다.
-- 사용자와 사진의 관계를, 좋아요를 경유하는 ER 다이어그램으로 그리세요. 단, 속성은 생략합니다.


-- 4 사용자는 사진에 대해 댓글을 작성하지 않을 수 있고, 사진도 사용자로부터 댓글을 받지 못 할 수 있습니다.
-- 사용자와 사진의 관계를, 댓글을 경유하는 ER 다이어그램으로 그리세요. 단, 속성은 생략합니다.


-- 5 이전 1~4의 답을 통합해 하나의 ER 다이어그램을 완성하세요.




